Repository: ArmHarMkr/ScanGuardDiplom
Catalog: ScanGuard/Resources/Resources.*.resx
Languages: am

# RegisterConfirm_Step1
source: Open your email inbox
am: Բացեք Ձեր էլ․ փոստի մուտքի արկղը

# RegisterConfirm_Step2
source: Find our email (check spam folder too)
am: Գտեք մեր նամակը (ստուգեք նաև սպամի թղթապանակը)

# RegisterConfirm_Step3
source: Click the confirmation link
am: Սեղմեք հաստատման հղումը

# RegisterConfirm_Slogan
source: Your first line of defense in the digital world
am: Ձեր առաջին պաշտպանության գիծը թվային աշխարհում

# ConfirmEmail_Title
source: Confirm email
am: Հաստատել էլ․ փոստը

# ConfirmEmail_SuccessTitle
source: Email Confirmed!
am: Էլ․ փոստը հաստատված է!

# ConfirmEmail_ErrorTitle
source: Confirmation Error
am: Հաստատման սխալ

# ConfirmEmail_SecurityBadge
source: Account Secured
am: Հաշիվը պաշտպանված է

# ConfirmEmail_LinkLogin
source: Continue to Login
am: Շարունակել մուտք գործել

# ConfirmEmail_LinkHome
source: Return to Home
am: Վերադառնալ գլխավոր էջ

# ConfirmEmail_Slogan
source: Your first line of defense in the digital world
am: Ձեր առաջին պաշտպանության գիծը թվային աշխարհում

# Tfa_Title
source: Two-Factor Authentication
am: Երկու գործոնով վավերացում

# Tfa_Description
source: Manage your two-factor authentication settings.
am: Կառավարեք Ձեր երկու գործոնով վավերացման կարգավորումները:

# Tfa_NoRecoveryCodes
source: You have no recovery codes left.
am: Դուք չունեք մնացած վերականգնման կոդեր:

# Tfa_NoRecoveryCodesAction
source: You must generate a new set of recovery codes before you can log in with a recovery code.
am: Դուք պետք է ստեղծեք վերականգնման կոդերի նոր խումբ՝ վերականգնման կոդով մուտք գործելու համար:

# Tfa_OneRecoveryCode
source: You have 1 recovery code left.
am: Դուք ունեք 1 մնացած վերականգնման կոդ:

# Tfa_OneRecoveryCodeAction
source: You can generate a new set of recovery codes.
am: Դուք կարող եք ստեղծել վերականգնման կոդերի նոր խումբ:

# Tfa_FewRecoveryCodes
source: You have {0} recovery codes left.
am: Դուք ունեք {0} մնացած վերականգնման կոդ:

# Tfa_FewRecoveryCodesAction
source: You should generate a new set of recovery codes.
am: Դուք պետք է ստեղծեք վերականգնման կոդերի նոր խումբ:

# Tfa_ButtonForgetBrowser
source: Forget this browser
am: Մոռանալ այս բրաուզերը

# Tfa_ButtonDisable2fa
source: Disable 2FA
am: Անջատել 2FA-ն

# Tfa_ButtonResetCodes
source: Reset recovery codes
am: Վերականգնել վերականգնման կոդերը

# Tfa_SubtitleAuthenticator
source: Authenticator App
am: Վավերացնող հավելված

# Tfa_LinkAddAuthenticator
source: Add authenticator app
am: Ավելացնել վավերացնող հավելված

# Tfa_LinkSetupAuthenticator
source: Set up authenticator app
am: Կարգավորել վավերացնող հավելված

# Tfa_LinkResetAuthenticator
source: Reset authenticator app
am: Վերականգնել վավերացնող հավելվածը

# Tfa_PrivacyNotAccepted
source: Privacy and cookie policy have not been accepted.
am: Գաղտնիության և քուքիների քաղաքականությունը ընդունված չէ:

# Tfa_PrivacyNotAcceptedAction
source: You must accept the policy before you can enable two-factor authentication.
am: Դուք պետք է ընդունեք քաղաքականությունը՝ երկու գործոնով վավերացումը միացնելու համար:

source: File Hash
am: Ֆայլի հեշ

# FileHistoryText
source: View the history of your scanned files and their security details
am: Դիտեք ձեր սկանավորված ֆայլերի պատմությունը և դրանց անվտանգության մանրամասները

source: File Name
am: Ֆայլի անուն

# FileScanButton
source: Scan File
am: Սկանավորել ֆայլը

source: File Scan History
am: Սկանավորած ֆայլերի պատմություն

source: File Scanner
am: Ֆայլերի սկաներ

# FileScannerText
source: Upload your files to check for malware, vulnerabilities, and security threats with ScanGuard’s advanced scanning technology.
am: Վերբեռնեք ձեր ֆայլերը՝ ScanGuard-ի առաջադեմ սկանավորման տեխնոլոգիայի միջոցով ստուգելու համար վնասակար ծրագրերի, խոցելիությունների և անվտանգության սպառնալիքների առկայությունը։

# FileUpload
source: Upload File for Scanning
am: Սկանավորման համար ներբեռնեք ֆայլը

# Keep Your Files SecureText
source: Regularly scan your files to ensure they are free from threats. Try our website scanner for comprehensive security.
am: Պարբերաբար սկանավորեք ձեր ֆայլերը՝ համոզվելու համար, որ դրանք զերծ են սպառնալիքներից: Փորձեք մեր կայքերի սկաները՝ համապարփակ անվտանգության համար:

source: Keep Your Files Secure
am: Պահպանեք ձեր ֆայլերը անվտանգ

source: Malicious
am: Վտանգավոր

source: No
am: Ոչ

source: Scan Date
am: Սկանավորման ամսաթիվ

# ScanWebButton
source: Scan Website
am: Սկանավորել կայքը

source: Vulnerability Type
am: Խոցելիության տիպը

source: Yes
am: Այո

source: Community Feedback
am: Այլ օգտատերերի արձագանքներ

# ConnectAccountText
source: In the bot, send the command /connect TOKEN to link your ScanGuard account.
am: Բոտում ուղարկեք /connect TOKEN հրամանը՝ ձեր ScanGuard հաշիվը կապելու համար։

source: Connect Your Account
am: Միացրեք ձեր հաշիվը

source: Copy Token
am: Պատճենել թոքենը

# Footer
source: Maximize Your Security
am: Առավելագույնի հասցրեք ձեր անվտանգությունը

# FooterText
source: Stay ahead of threats with ScanGuard Premium. Enjoy exclusive features and seamless Telegram integration.
am: Մնացեք սպառնալիքներից առաջ ScanGuard Premium-ի միջոցով: Վայելեք բացառիկ հնարավորությունները և Telegram-ի անխափան ինտեգրումը:

source: Get Your Token
am: Ստացիր քո թոքենը

# GetYourTokenText
source: Click "Get Token" above or copy your existing token using the "Copy Token" button.
am: Սեղմեք վերևում «Ստանալ թոքեն» կամ պատճենեք ձեր առկա թոքենը՝ օգտագործելով «Պատճենել թոքենը» կոճակը։

source: Leave Your Feedback
am: Գրիր քո կարծիքը

source: Negative
am: Բացասական

source: Positive
am: Դրական

source: Remove
am: Ջնջել

# ReviewText
source: Share your experience with our platform and read feedback from others
am: Կիսվեք ձեր փորձով մեր հարթակի հետ և կարդացեք ուրիշների կարծիքները

source: Review Type
am: Տեսակը

# StartBot
source: Start the Bot
am: Միացրեք բոտը

# StartBotText
source: Open Telegram and start our premium bot by clicking the button below.
am: Բացեք Telegram-ը և գործարկեք մեր պրեմիում բոտը՝ սեղմելով ստորև նշված կոճակը։

# TGChoosePrem
source: Why Choose ScanGuard Premium?
am: Ինչո՞ւ ընտրել ScanGuard Premium-ը։

# TGChoosePremOne
source: Real-Time Alerts
am: Իրական ժամանակի ծանուցումներ

# TGChoosePremOneText
source: Receive instant Telegram notifications about security threats and scan results.
am: Ստացեք ակնթարթային Telegram ծանուցումներ անվտանգության սպառնալիքների և սկանավորման արդյունքների մասին։

# TGChoosePremThree
source: Advanced Security
am: Ընդլայնված անվտանգություն

# TGChoosePremThreeText
source: Access exclusive tools and deeper scans for ultimate protection.
am: Մուտք գործեք բացառիկ գործիքների և ավելի խորը սկանավորման՝ առավելագույն պաշտպանության համար։

# TGChoosePremTwo
source: Priority Support
am: Առաջնահերթ աջակցություն

# TGChoosePremTwoText
source: Get dedicated assistance from our expert team whenever you need it.
am: Ստացեք նվիրված օգնություն մեր մասնագիտական ​​​​թիմից, երբ դրա կարիքը ունեք։

# TGConnectText
source: How to Connect to Our Telegram Bot
am: Ինչպես միանալ մեր Telegram Bot-ին

# TGTokenText
source: Your Telegram Token
am: Ձեր Telegram թոքենը

# TGWelcome
source: Welcome to ScanGuard Premium
am: Բարի գալուստ ScanGuard Premium

# TGWelcomeText
source: Unlock exclusive features and connect to our Telegram bot for real-time security notifications.
am: Բացեք բացառիկ հնարավորությունները և միացեք մեր Telegram բոտին՝ իրական ժամանակում անվտանգության ծանուցումներ ստանալու համար։

# UserReview
source: User Reviews
am: Օգտատերերի Կարծիքները

source: You have already submitted a review.
am: Դուք արդեն ներկայացրել եք կարծիք
