Repository: ArmHarMkr/ScanGuardDiplom
Catalog: ScanGuard/Resources/Resources.*.resx
Languages: am

source: About ScanGuard
am: ScanGuard-ի մասին

# About_text
source: We’re dedicated to making the digital world safer with powerful tools to scan and secure websites and files from vulnerabilities.
am: Մենք նվիրված ենք թվային աշխարհն ավելի ապահով դարձնելուն հզոր գործիքներով՝ կայքերն ու ֆայլերը խոցելիությունից սկանավորելու և պաշտպանելու համար

source: Accessibility
am: Հասանելիություն

# AccessibilityText
source: Cybersecurity for everyone, everywhere.
am: Կիբեռանվտանգություն բոլորի համար, ամենուր:

# AccessToCommunity
source: Access to community forums
am: Մուտք դեպի համայնքի ֆորումներ

# AdvancedAnalytics
source: Advanced analytics and detailed reports
am: Զարգացած վերլուծություն և մանրամասն հաշվետվություններ

source: Advanced Scanning
am: Զարգացած սկանավորում

# AllInOne
source: All-in-one solution for your digital security.
am: Բոլորը մեկում լուծում՝ ձեր թվային անվտանգության համար

source: Analyzed
am: Վերլուծվել է

# APIAccess
source: API access for integration with your tools
am: API հասանելիություն՝ ձեր գործիքների հետ ինտեգրման համար

# BasicSupport
source: Basic support via email (response within 48 hours)
am: Հիմնական աջակցություն՝ էլ․ փոստով (պատասխան՝ 48 ժամում)

# ChooseAI
source: AI-Powered
am: Ներդրված ԱԲ

# ChooseAIText
source: Smart tech for smarter detection.
am: Խելացի տեխնոլոգիա ավելի խելացի հայտնաբերման համար:

# ChooseCost
source: Cost-Effective
am: Արդյունավետ ծախս

# ChooseCostText
source: Premium security at fair prices.
am: Պրեմիում անվտանգություն արդար գներով:

# ChooseFast
source: Fast Scans
am: Արագ սկանավորում

# ChooseFastText
source: Get results in seconds, not hours.
am: Ստացեք արդյունքներ վայրկյանների ընթացքում, ոչ թե ժամերի:

# ChooseSupport
source: Support
am: Աջակցություն

# ChooseSupportText
source: Help whenever you need it.
am: Ստացեք օգնություն, երբ դրա կարիքը ունեք:

source: Clients Protected
am: Պաշտպանված հաճախորդներ

source: Comprehensive Protection
am: Համապարփակ պաշտպանություն

# ConnectText
source: Follow us for updates and tips on staying secure online.
am: Հետևեք մեզ՝ առցանց անվտանգ մնալու թարմացումների և խորհուրդների համար:

source: Connect with ScanGuard
am: Կապ ScanGuard-ի հետ

source: Contact Us
am: Կոնտակներ

# CustomScan
source: Custom scan schedules and automation
am: Անհատական սկանավորման ժամանակացույց և ավտոմատացում

source: Detected threat on
am: Բացահայտված սպառնալիք՝

source: Digital
am: Թվային

source: Email։
am: էլ. փոստ

source: Enter URL to Scan
am: Սկանավորման համար ներմուծեք հղումը

# Essential
source: Essential scanning for websites and files
am: Հիմնական սկանավորում վեբկայքերի և ֆայլերի համար

# ExploreAdvanced
source: Explore advanced tools to secure your digital world.
am: Ուսումնասիրեք առաջադեմ գործիքները՝ ձեր թվային աշխարհը ապահովելու համար

source: Files Analyzed
am: Վերլուծված ֆայլեր

# FutureStartScanningNow
source: Start scanning now
am: Սկսեք սկանավորումը հիմա

# FutureText
source: Join ScanGuard to protect your websites and files with confidence.
am: Միացե՛ք ScanGuard-ին՝ ձեր կայքերն ու ֆայլերը վստահորեն պաշտպանելու համար:

source: Get in Touch
am: Կապ մեզ հետ

source: Get Started
am: Սկսել

source: Go to Dashboard
am: Վահանակ

source: Guard
am: Պաշտպանիր

source: Happy Users
am: Գոհ օգտագործողներ

# Home_Empty_Message
source: No scanned websites yet. Be the first!
am: Դեռևս սկանավորված վեբկայքեր չկան։ Եղեք առաջինը։

# Home_Hero_Subtitle
source: Advanced cybersecurity solutions with ScanGuard. Protect your websites, files, and data in real-time.
am: Զարգացած կիբանվտանգության լուծումներ ScanGuard-ի հետ։ Պաշտպանեք ձեր վեբկայքերը, ֆայլերը և տվյալները իրական ժամանակում։

# Home_Section_Title
source: Building a Safer Digital World
am: Ապահով թվային աշխարհի կառուցում

# IdealForBusinesses
source: Ideal for businesses and professionals needing advanced security features and priority support.
am: Իդեալական է բիզնեսի և մասնագետների համար, որոնք պահանջում են առաջադեմ անվտանգություն և առաջնահերթ աջակցություն

source: Innovation
am: Նորարարություն

# InnovationText
source: Evolving to outpace cyber threats.
am: Զարգացում՝ կիբեռ սպառնալիքներից առաջ անցնելու համար:

# InstantNotifications
source: Instant notifications for potential threats.
am: Ակնթարթային ծանուցումներ հնարավոր սպառնալիքների վերաբերյալ

source: Join Our Mission
am: Միացեք մեր առաքելությանը

# JoinScanGuard
source: Join ScanGuard today and take control of your cybersecurity.
am: Միացեք ScanGuard-ին և կառավարեք ձեր կիբանվտանգությունը

source: Latest Security Updates
am: Վերջին անվտանգության թարմացումները

source: Log In
am: Մուտք

# MonthlySecurity
source: Monthly security consultation with experts
am: Անվտանգության ամսական խորհրդատվություն փորձագետների հետ

source: Our Impact
am: Ազդեցությունը

source: Our Purpose
am: Մեր նպատակները

source: Our Team
am: Մեր Թիմը

# PerfectFor
source: Perfect for individuals and small projects looking to secure their digital assets with essential tools.
am: Իդեալական է անհատների և փոքր նախագծերի համար, որոնք ցանկանում են պաշտպանել իրենց թվային ակտիվները հիմնական գործիքներով

source: Precision
am: Ճշգրտություն

# PrecisionText
source: Accurate detection of every vulnerability.
am: Յուրաքանչյուր խոցելիության ճշգրիտ հայտնաբերում:

# PremiumCommunityChat
source: Premium community chat with other users
am: Պրեմիում համայնքի չաթ՝ այլ օգտատերերի հետ

# PrioritySupport
source: Priority support with 24/7 assistance
am: Առաջնահերթ աջակցություն՝ 24/7

source: Protection
am: Պաշտպանություն

# ProtectionText
source: Robust scanning to keep your assets secure.
am: Ուժեղ սկանավորում՝ ձեր ակտիվները ապահով պահելու համար:

# PurposeDotOne
source: Provide user-friendly scanning solutions.
am: Տրամադրել օգտագործողի համար հարմար սկանավորման լուծումներ:

# PurposeDotThree
source: Ensure affordability without compromise.
am: Ապահովել մատչելիությունը առանց փոխզիջումների

# PurposeDotTwo
source: Stay ahead of evolving cyber threats.
am: Մնացեք զարգացող կիբեռ սպառնալիքներից հեռու:

# PurposeTextOne
source: Founded in 2025, ScanGuard exists to simplify cybersecurity. Our purpose is to empower businesses, developers, and individuals with accessible tools to protect their websites and files from vulnerabilities.
am: ScanGuard-ը, որը հիմնադրվել է 2025 թվականին, գոյություն ունի կիբերանվտանգությունը պարզեցնելու համար: Մեր նպատակն է հզորացնել ձեռնարկություններին, ծրագրավորողներին և անհատներին հասանելի գործիքներով՝ պաշտպանելու իրենց կայքերն ու ֆայլերը խոցելիությունից:

# PurposeTextTwo
source: We’re driven by a commitment to deliver fast, accurate scans that catch threats before they strike. Our goal is a digital world where safety is seamless and universal.
am: Մենք առաջնորդվում ենք արագ, ճշգրիտ սկանավորումներ մատուցելու պարտավորությամբ, որոնք վտանգում են նախքան դրանք հարվածելը: Մեր նպատակը թվային աշխարհն է, որտեղ անվտանգությունն անխափան է և ունիվերսալ:

source: Rank
am: Վարկանիշ

# ReadyToScan
source: Ready to Scan More?
am: Պատրաստ եք սկանավորելու ավելին?

# ReadyToSecure
source: Ready to Secure Your Online Presence?
am: Պատրաստ եք ապահովելու ձեր առցանց ներկայությունը?

# RealTime
source: Real-time vulnerability detection for websites and files.
am: Իրական ժամանակում խոցելիությունների հայտնաբերում վեբկայքերի և ֆայլերի համար

source: Real-Time Alerts
am: Իրական ժամանակում նախազգուշացումներ

source: Scan Count
am: Սկանավորումների քանակ

source: Scanned
am: Սկանավորվել է

source: Scanner Text
am: Պաշտպանեք ձեր կայքը՝ բացահայտելով անվտանգության ռիսկերը ScanGuard-ի առաջադեմ սկանավորման տեխնոլոգիայի միջոցով:

source: Scans Performed
am: Սկանավորման քանակ

source: Scan Your Website
am: Սկանավորեք ձեր կայքը

source: Secure Your Future
am: Ապահովիր քո ապագան

# SecurityNews
source: Security news updates and insights
am: Անվտանգության նորություններ և վերլուծություններ

source: Send Message
am: Ուղարկել նամակ

source: Sign Up Now
am: Գրանցվիր հիմա

source: Start Scanning
am: Սկսել սկանավորումը

# TailoredPlans
source: Tailored Plans for Your Needs
am: Անհատականացված փաթեթներ՝ ձեր կարիքների համար

# TeamOneName
source: Harutyun Mkrtchyan
am: Հարություն Մկրտչյան

# TeamOneState
source: Founder & CEO
am: Հիմնադիր և գործադիր տնօրեն

# TeamOneText
source: Harutyun and Davit launched ScanGuard in 2025 with a vision to make cybersecurity simple. Her expertise in software engineering drives our mission to protect the digital world.
am: Հարությունը և Դավիթը գործարկել են ScanGuard-ը 2025 թվականին՝ կիբեռանվտանգությունը պարզեցնելու տեսլականով: Ծրագրային ապահովման ճարտարագիտության մեջ նրա փորձառությունը մղում է թվային աշխարհը պաշտպանելու մեր առաքելությունը:

# TeamTwoName
source: Davit Gasparyan
am: Դավիթ Գասպարյան

# TeamTwoState
source: Lead Developer
am: Գլխավոր ծրագրավորող

# TeamTwoText
source: Davit and Harutyun build the heart of our scanning tools. With a passion for AI and security, he ensures our platform is powerful and intuitive.
am: Դավիթն ու Հարությունը կերտում են մեր սկանավորման գործիքների սիրտը: Անվտանգության և ԱԲ հանդեպ կիրք ունենալով՝ նրանք ապահովում են, որ մեր հարթակը լինին հզոր և ինտուիտիվ պարզ։

# TelegramBot
source: Telegram bot access with full website features
am: Telegram բոտ՝ ամբողջ վեբկայքի գործառույթներով

source: Top Security Hotspots
am: Թոփ ստուգված կայքերը

# Trusted
source: Trusted by Our Community
am: Վստահված է մեր օգտատերերի կողմից

# UnlimitedScans
source: Unlimited scans for websites and files
am: Անսահմանափակ սկանավորում վեբկայքերի և ֆայլերի համար

source: Upgrade to Premium
am: Անցնել պրեմիում տարբերակի

# UpTo3File
source: Up to 3 file scans per day
am: Մինչև 3 ֆայլի սկանավորում օրական

source: User Trust
am: Օգտատերերի վստահություն

source: Verified User
am: Հաստատված օգտատեր

source: View More
am: Դիտել ավելին

source: Vulnerabilities Detected
am: Բացահայտված խոցելիություններ

source: vulnerabilities found
am: բացահայտվել է խոցելիություն

source: Vulnerability Scanner
am: Խոցելիությունների սկանավորում

source: Website Scans
am: Կայքերի սկանավորում

source: Websites Scanned
am: Սկանավորված վեբկայքեր

source: Website URL
am: Վեբկայքի URL

source: What Drives Us
am: Մեր մոտիվացիան

source: Why Choose ScanGuard
am: Ինչու ScanGuard

source: World
am: Աշխարհը

source: Write a Review
am: Գրել կարծիք

source: Your
am: Քո

source: Your Email
am: Էլ. փոստ

source: Your Message
am: Ձեր նամակը

source: Your Name
am: Անուն

source: Your Security Advantage
am: Ձեր անվտանգության առավելությունը

# TwoFactor_ConfigureAppTitle
source: Configure Authenticator App
am: Մուտքի հավելվածի կարգավորում

# TwoFactor_SetupDescription
source: Set up two-factor authentication with an authenticator app.
am: Կարգավորեք երկու գործոնով նույնականացումը մուտքի հավելվածի միջոցով:

# TwoFactor_Step1Title
source: 1. Download an App
am: 1. Ներբեռնեք հավելված

# TwoFactor_Step1Description
source: Install a two-factor authenticator app like Microsoft Authenticator or Google Authenticator.
am: Տեղադրեք երկու գործոնով նույնականացման հավելված, ինչպիսիք են Microsoft Authenticator կամ Google Authenticator:

# TwoFactor_Step2Title
source: 2. Scan QR Code
am: 2. Սկանավորեք QR կոդը

# TwoFactor_Step2Description
source: Scan the QR code below or enter the key into your authenticator app. Spaces and casing do not matter.
am: Սկանավորեք ստորև ներկայացված QR կոդը կամ մուտքագրեք բանալին Ձեր մուտքի հավելվածում: Բացատներն ու տառերի մեծությունը նշանակություն չունեն:

# TwoFactor_QRCodeHelpLink
source: Learn how to enable QR code generation.
am: Իմացեք, թե ինչպես միացնել QR կոդի ստեղծումը:

# TwoFactor_Step3Title
source: 3. Verify Code
am: 3. Հաստատեք կոդը

# TwoFactor_Step3Description
source: Enter the unique code provided by your authenticator app to complete setup.
am: Մուտքագրեք Ձեր հավելվածի կողմից տրամադրված եզակի կոդը՝ կարգավորումն ավարտելու համար:

# TwoFactor_VerificationCodeLabel
source: Verification Code
am: Հաստատման կոդ

# TwoFactor_VerificationCodePlaceholder
source: Enter code
am: Մուտքագրեք կոդը

# TwoFactor_VerifyButton
source: Verify
am: Հաստատել

# Nav_Main
source: Main
am: Գլխավոր

# Nav_AboutUs
source: About Us
am: Մեր մասին

# Nav_Review
source: Review
am: Կարծիք

# Nav_Sites
source: Sites
am: Կայքեր

# Nav_Scanner
source: Scanner
am: Սկաներ

# Nav_ScannedSites
source: Scanned Sites
am: Սկանավորված կայքեր

# Nav_Files
source: Files
am: Ֆայլեր

# Nav_FileScanner
source: File Scanner
am: Ֆայլերի սկաներ

# Nav_ScannedFiles
source: Scanned Files
am: Սկանավորված ֆայլեր

# Nav_Chat
source: Chat
am: Զրույց

# Nav_Corporation
source: Corporation
am: Կորպորացիա

# Nav_Premium
source: Premium
am: Պրեմիում

# Nav_Users
source: Users
am: Օգտատերեր

# Nav_GetToken
source: Get Token
am: Ստանալ Տոկեն

# Nav_AllNews
source: All News
am: Բոլոր նորությունները

# Nav_GetCorpRequests
source: Get Corp Requests
am: Կորպորացիա ստեղծելու հարցումներ

# Nav_News
source: News
am: Նորություններ

# Nav_ScanFile
source: Scan File
am: Սկանավորել ֆայլ

# Nav_History
source: History
am: Պատմություն

# Language_English
source: English
am: Անգլերեն

# Nav_Notifications
source: Notifications
am: Ծանուցումներ

# Nav_Profile
source: Profile
am: Պրոֆիլ

# Nav_Logout
source: Logout
am: Դուրս գալ

# Nav_Login
source: Login
am: Մուտք

# Nav_Register
source: Register
am: Գրանցվել

# History_Title
source: Scan History
am: Սկանավորման պատմություն

# History_Subtitle
source: Review and analyze past scans to keep your websites secure with ScanGuard’s AI-powered insights.
am: Դիտեք և վերլուծեք անցյալի սկանավորումները՝ Ձեր կայքերը անվտանգ պահելու համար ScanGuard-ի արհեստական բանականությամբ ապահովված պատկերացումներով:

# History_SearchPlaceholder
source: Search by URL...
am: Որոնել URL-ով...

# History_SortRecent
source: Sort by: Recent
am: Դասավորել՝ Վերջին

# History_SortVulnDesc
source: Vulnerabilities (High to Low)
am: Խոցելիություններ (Բարձրից ցածր)

# History_SortVulnAsc
source: Vulnerabilities (Low to High)
am: Խոցելիություններ (Ցածրից բարձր)

# History_SortDateAsc
source: Date (Oldest)
am: Ամսաթիվ (Ամենահին)

# History_ColumnWebsiteURL
source: Website URL
am: Կայքի URL

# History_ColumnScanDate
source: Scan Date
am: Սկանավորման ամսաթիվ

# History_ColumnVulnerabilityCount
source: Vulnerability Count
am: Խոցելիությունների քանակ

# History_ColumnVulnerabilityType
source: Vulnerability Type
am: Խոցելիության տեսակ

# History_ColumnActions
source: Actions
am: Գործողություններ

# History_NoVulnerabilities
source: No vulnerabilities found
am: Խոցելիություններ չեն հայտնաբերվել

# History_ButtonRemove
source: Remove
am: Հեռացնել

# History_ButtonAnalyze
source: Analyze
am: Վերլուծել

# History_ModalTitle
source: AI Analysis
am: ԱԲ վերլուծություն

# History_ModalLoading
source: Loading analysis...
am: Վերլուծությունը բեռնվում է...

# History_ModalError
source: Failed to load analysis
am: Չհաջողվեց բեռնել վերլուծությունը

# Sidebar_Profile
source: Profile
am: Պրոֆիլ

# Sidebar_ExternalLogins
source: External Logins
am: Արտաքին մուտքեր

# Sidebar_TwoFactorAuth
source: Two-Factor Auth
am: Երկու գործոնով նույնականացում

# Sidebar_ChangePassword
source: Change Password
am: Փոխել գաղտնաբառը

# Profile_Title
source: Profile
am: Պրոֆիլ

# Profile_StatusAdmin
source: Admin
am: Ադմին

# Profile_StatusPremium
source: Premium
am: Պրեմիում

# Profile_LabelFullName
source: Full Name
am: Ամբողջական անուն

# Profile_LabelEmail
source: Email
am: Էլ․ փոստ

# Profile_LabelPhoneNumber
source: Phone Number
am: Հեռախոսահամար

# Profile_PlaceholderFullName
source: Enter your full name
am: Մուտքագրեք Ձեր ամբողջական անունը

# Profile_PlaceholderPhoneNumber
source: Enter your phone number
am: Մուտքագրեք Ձեր հեռախոսահամարը

# Profile_ButtonSave
source: Save Changes
am: Պահպանել փոփոխությունները

# ChangePassword_Title
source: Change Password
am: Փոխել գաղտնաբառը

# ChangePassword_SectionTitle
source: Change Password
am: Փոխել գաղտնաբառը

# ChangePassword_Description
source: Set a new secure password.
am: Սահմանեք նոր անվտանգ գաղտնաբառ:

# ChangePassword_LabelCurrentPassword
source: Current Password
am: Ընթացիկ գաղտնաբառ

# ChangePassword_LabelNewPassword
source: New Password
am: Նոր գաղտնաբառ

# ChangePassword_LabelConfirmPassword
source: Confirm Password
am: Հաստատել գաղտնաբառը

# ChangePassword_PlaceholderCurrentPassword
source: Current password
am: Ընթացիկ գաղտնաբառ

# ChangePassword_PlaceholderNewPassword
source: New password
am: Նոր գաղտնաբառ

# ChangePassword_PlaceholderConfirmPassword
source: Confirm password
am: Հաստատել գաղտնաբառը

# ChangePassword_ButtonUpdate
source: Update
am: Թարմացնել

# ChangePassword_ButtonCancel
source: Cancel
am: Չեղարկել

# Scanner_Title
source: Vulnerability Scanner
am: Խոցելիության սկաներ

# Scanner_IntroSubtitle
source: Protect your website by identifying security risks with ScanGuard’s advanced scanning technology.
am: Պաշտպանեք Ձեր կայքը՝ բացահայտելով անվտանգության ռիսկերը ScanGuard-ի առաջադեմ սկանավորման տեխնոլոգիայով:

# Scanner_FormTitle
source: Scan Your Website
am: Սկանավորեք Ձեր կայքը

# Scanner_LabelUrl
source: Enter URL to Scan
am: Մուտքագրեք սկանավորման URL

# Scanner_ButtonStart
source: Start Scan
am: Սկսել սկանավորում

# Scanner_ResultsTitle
source: Scan Results
am: Սկանավորման արդյունքներ

# Scanner_PortResultsTitle
source: Port Scan Results
am: Պորտերի սկանավորման արդյունքներ

# Scanner_InfoTitle
source: Vulnerability Information
am: Խոցելիությունների մասին տեղեկատվություն

# Scanner_InfoSQLiDescription
source: Allows attackers to inject malicious SQL code into input fields, potentially accessing or altering database content.
am: Թույլ է տալիս ներարկել վնասակար SQL կոդ մուտքագրման դաշտերում, ինչը կարող է հանգեցնել տվյալների բազայի հասանելիության կամ փոփոխման:

# Scanner_InfoXSSDescription
source: Enables attackers to inject scripts into web pages, which run in users’ browsers, potentially stealing data or defacing the site.
am: Թույլ է տալիս ներարկել սկրիպտեր վեբ էջերում, որոնք աշխատում են օգտատերերի բրաուզերներում, ինչը կարող է հանգեցնել տվյալների գողության կամ կայքի վնասման:

# Scanner_InfoCSRFDescription
source: Tricks authenticated users into performing unintended actions (e.g., changing settings) via forged requests.
am: Խաբում է վավերացված օգտատերերին՝ կատարելով անցանկալի գործողություններ (օրինակ՝ կարգավորումների փոփոխություն) կեղծված հարցումների միջոցով:

# Scanner_InfoIDORDescription
source: Insecure Direct Object References allow attackers to access unauthorized resources by manipulating identifiers.
am: Անվտանգ օբյեկտների ուղղակի հղումները թույլ են տալիս մուտք գործել չթույլատրված ռեսուրսներ՝ մանիպուլյացիայի միջոցով:

# Scanner_InfoBrokenAuthDescription
source: Weak authentication lets attackers bypass login or hijack sessions, gaining unauthorized access.
am: Թույլ վավերացումը թույլ է տալիս շրջանցել մուտքը կամ գրավել սեանսներ՝ ձեռք բերելով չթույլատրված մուտք:

# Scanner_InfoWeakPasswordDescription
source: Simple passwords make accounts vulnerable to brute-force or guessing attacks.
am: Պարզ գաղտնաբառերը հաշիվները խոցելի են դարձնում brute force կամ հայտնի գաղտնաբառերը գուշակելու համար:

# Scanner_InfoSecurityMisconfigDescription
source: Improper settings (e.g., open ports, default credentials) expose vulnerabilities in servers or apps.
am: Սխալ կարգավորումները (օրինակ՝ բաց պորտեր, լռելյայն հավատարմագրեր) բացահայտում են խոցելիությունները սերվերներում կամ հավելվածներում:

# Scanner_InfoUnvalidatedRedirectDescription
source: Untrusted redirect inputs can send users to malicious sites, aiding phishing attacks.
am: Չստուգված վերահղման մուտքերը կարող են օգտատերերին ուղարկել վնասակար կայքեր՝ նպաստելով ֆիշինգի հարձակումներին:

# Scanner_InfoDirectoryListingDescription
source: Misconfigured servers expose directory contents, revealing sensitive files or structure.
am: Սխալ կարգավորված սերվերները բացահայտում են պանակների բովանդակությունը՝ ցույց տալով գաղտնի տվյալներ կամ կառուցվածքը:

# Scanner_InfoLFIDescription
source: Allows attackers to include local files (e.g., config files), potentially exposing sensitive data.
am: Թույլ է տալիս ներառել տեղային ֆայլեր (օրինակ՝ կոնֆիգուրացիոն ֆայլեր), ինչը կարող է բացահայտել զգայուն տվյալներ:

# Scanner_InfoRFIDescription
source: Permits inclusion of remote malicious files, often leading to code execution on the server.
am: Թույլ է տալիս ներառել հեռակա վնասակար ֆայլեր, հաճախ հանգեցնելով կոդի կատարման սերվերում:

# Scanner_InfoHTTPResponseSplittingDescription
source: Exploits header manipulation to inject content or redirect users to malicious sites.
am: Օգտագործում է վերնագրերի մանիպուլյացիան՝ բովանդակություն ներարկելու կամ օգտատերերին վերահղելու վնասակար կայքեր:

# Scanner_InfoPhishingDescription
source: Deceptive techniques trick users into revealing credentials via fake pages or links.
am: Խաբուսիկ տեխնիկաները խաբում են օգտատերերին՝ բացահայտելով հավատարմագրերը կեղծ էջերի կամ հղումների միջոցով:

# Scanner_InfoNotSecureDomainDescription
source: Non-HTTPS connections expose data to interception or tampering by attackers.
am: Ոչ Secure - անվտանգ կապերը բացահայտում են տվյալների գաղտնալսման կամ փոփոխման համար:

# Scanner_CtaTitle
source: Stay Secure with ScanGuard
am: Մնացեք անվտանգ ScanGuard-ի հետ

# Scanner_CtaSubtitle
source: Run regular scans to keep your website safe from vulnerabilities.
am: Կատարեք կանոնավոր սկանավորումներ՝ Ձեր կայքը խոցելիություններից պաշտպանելու համար:

# Scanner_CtaButton
source: Scan Another URL
am: Սկանավորել մեկ այլ URL

# Scanner_ResultDetected
source: Detected
am: Հայտնաբերված

# Scanner_ResultNotDetected
source: Not Detected
am: Չի հայտնաբերվել

# Scanner_ResultSecure
source: Secure
am: Անվտանգ

# Scanner_ResultInsecure
source: Insecure
am: Անապահով

# Scanner_PortOpen
source: Open
am: Բաց

# Scanner_PortClosed
source: Closed
am: Փակ

# Login_Title
source: Log in
am: Մուտք գործել

# Login_FormTitle
source: Log In
am: Մուտք գործել

# Login_PlaceholderEmail
source: Email
am: Էլ․ փոստ

# Login_PlaceholderPassword
source: Password
am: Գաղտնաբառ

# Login_LabelRememberMe
source: Remember Me
am: Հիշել ինձ

# Login_ButtonSubmit
source: Login
am: Մուտք

# Login_TextNoAccount
source: Don’t have an account?
am: Հաշիվ չունե՞ք:

# Login_LinkSignUp
source: Sign up
am: Գրանցվել

# Register_Title
source: Register
am: Գրանցվել

# Register_PageTitle
source: Registration
am: Գրանցում

# Register_FormTitle
source: Create a new account
am: Ստեղծել նոր հաշիվ

# Register_PlaceholderEmail
source: Email
am: Էլ․ փոստ

# Register_PlaceholderFullName
source: Full name
am: Անուն Ազգանուն

# Register_PlaceholderPassword
source: Password
am: Գաղտնաբառ

# Register_ButtonSubmit
source: Register
am: Գրանցվել

# Register_TextHaveAccount
source: Already have an account?
am: Արդեն ունե՞ք հաշիվ:

# Register_LinkLogin
source: Log In
am: Մուտք գործել

# Login2fa_Title
source: Two-factor Authentication
am: Երկգործով վավերացում

# Login2fa_Description
source: Your login is protected with an authenticator app. Enter your authenticator code below.
am: Ձեր մուտքը պաշտպանված է վավերացնող հավելվածով: Ստորև մուտքագրեք Ձեր վավերացման կոդը:

# Login2fa_PlaceholderCode
source: Authenticator Code
am: Վավերացման կոդ

# Login2fa_ValidateCode
source: Please enter a valid 2FA code
am: Խնդրում ենք մուտքագրել վավեր 2FA կոդ

# Login2fa_LabelRememberMachine
source: Remember this machine
am: Հիշել այս սարքը

# Login2fa_ButtonSubmit
source: Log In
am: Մուտք գործել

# Login2fa_FooterText
source: Don't have access to your authenticator device? You can log in with a recovery code.
am: Չունե՞ք մուտք դեպի Ձեր վավերացնող սարքը: Դուք կարող եք մուտք գործել վերականգնման կոդով:

# Login2fa_LinkRecoveryCode
source: log in with a recovery code
am: մուտք գործել վերականգնման կոդով

# RegisterConfirm_Title
source: Register confirmation
am: Գրանցման հաստատում

# RegisterConfirm_FormTitle
source: Check Your Email
am: Ստուգեք Ձեր էլ․ փոստը

# RegisterConfirm_Description
source: We've sent a confirmation email to {0}. Please check your inbox and click the confirmation link to activate your ScanGuard account.
am: Մենք հաստատման նամակ ենք ուղարկել {0} հասցեին: Խնդրում ենք ստուգել Ձեր էլ․ փոստը և սեղմել հաստատման հղումը՝ Ձեր ScanGuard հաշիվն ակտիվացնելու համար:
